benchmark/FieldExamples/turek3IGAFSI/turek3IGAFSIOF/constant/EmpireDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

densityFluid   densityFluid [ 1 -3 0 0 0 0 0 ] 1000;

FSIInterfaces (
	fsiWall {
		patchNames (fsiWall);
	}
);

// ************************************************************************* //
