benchmark/FieldExamples/turek3IGAFSI/turek3IGAFSIOF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            wall;
        nFaces          62;
        startFace       4224;
    }
    bottom
    {
        type            wall;
        nFaces          62;
        startFace       4286;
    }
    frontAndBack
    {
        type            empty;
        nFaces          4344;
        startFace       4348;
    }
    fsiWall
    {
        type            wall;
        nFaces          50;
        startFace       8692;
    }
    inlet
    {
        type            patch;
        nFaces          8;
        startFace       8742;
    }
    outlet
    {
        type            patch;
        nFaces          34;
        startFace       8750;
    }
    cylinder
    {
        type            patch;
        nFaces          24;
        startFace       8784;
    }
)

// ************************************************************************* //
